<template>
  <div id="app">
    <h2>Задание 1</h2>
    <p>Создание базового хранилища: Создайте новое Vuex-хранилище, определите в нем состояние (state) и несколько базовых
      мутаций (mutations). Подключите хранилище к вашему приложению Vue.js и используйте его для управления состоянием
      приложения. Создайте счетчик который хранит состояние count. Создайте две мутации, которые увеличивают и уменьшают
      значение счетчика. Создайте компонент счетчик</p>
    <CounterComp />
    <h2>Задание 2</h2>
    <p>Управление корзиной покупок. Вы разрабатываете интернет-магазин и вам необходимо реализовать функциональность
      управления корзиной покупок с использованием Vuex и геттеров. Создайте хранилище Vuex с именем "store". В состоянии
      (state) хранилища создайте массив "cartItems", в котором будут храниться объекты товаров в корзине. Каждый объект
      товара должен иметь следующие свойства: id, name, price. Создайте мутацию (mutation) с именем "ADD_ITEM_TO_CART",
      которая принимает товар в качестве параметра и добавляет его в массив "cartItems". Создайте геттер (getter) с именем
      "cartItems", который возвращает массив товаров в корзине.
      <button @click="addItemToCart({ id: 1, name: 'Товар', price: 10 })">Добавить в корзину</button>
      Создайте геттер с именем "totalItems", который возвращает общее количество товаров в корзине. Создайте геттер с
      именем "totalPrice", который возвращает общую стоимость всех товаров в корзине. Создайте действие (action) с именем
      "addToCart", которое принимает товар в качестве параметра и вызывает мутацию "ADD_ITEM_TO_CART". В компоненте Vue.js
      создайте список товаров, которые можно добавить в корзину. Каждый товар должен иметь кнопку "Добавить в корзину",
      при нажатии на которую вызывается метод для добавления товара в корзину. Выведите информацию о корзине покупок на
      вашем компоненте. Отобразите список товаров в корзине, общее количество товаров и общую стоимость.
    </p>
    <CartItemsComp />
    <h2>Задание 3</h2>
    <p>Вам необходимо создать функциональность получения данных с сервера и сохранения их в хранилище Vuex с
      использованием действий. В вашем хранилище Vuex создайте состояние (state), в котором будет храниться массив данных.
      Создайте мутацию (mutation) для сохранения полученных данных в состояние. Создайте действие (action) для выполнения
      запроса к серверу и вызова соответствующей мутации. В вашем компоненте Vue.js вызовите действие для получения данных
      с сервера и отобразите их на вашем компоненте.</p>
    <h3>Задание 3 выполнено в рамках задания 2 (эмуляция получения информации с сервера)</h3>
  </div>
</template>

<script>
import CartItemsComp from './components/CartItemsComp.vue';
import CounterComp from './components/CounterComp.vue';

export default {
  name: 'App',
  components: {
    CounterComp,
    CartItemsComp
  },
}
</script>

<style lang="scss">
#app {
  font-family: Avenir, Helvetica, Arial, sans-serif;
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  text-align: center;
  color: #2c3e50;
  margin-top: 60px;
}
</style>
