// Задание 1
// Создание простого счетчика: Создайте компонент счетчика, который имеет кнопку "+" и кнопку "-", и отображает текущее значение счетчика. При нажатии на кнопки счетчик должен увеличиваться или уменьшаться соответственно.

new Vue({
    el: '#task1',
    data: {}
})

// Задание 2
// Создайте компонент списка дел (to-do list), в котором можно добавлять и удалять элементы. Каждый элемент списка должен иметь кнопку удаления, при нажатии на которую элемент списка будет удаляться.

new Vue({
    el: '#task2',
    data: {}
});

// Задание 3
// Создайте компонент списка, который отображает массив элементов. Добавьте текстовое поле для фильтрации списка. При вводе текста в поле, список должен автоматически обновляться, отображая только элементы, содержащие введенный текст.

new Vue({
    el: '#task3',
    data: {}
});

// Задание 4
// Вам необходимо создать компонент "Товар", который будет отображать информацию о товаре, включая название, описание и цену. Кроме того, вы должны реализовать фильтрацию товаров по цене(по возрастанию и убыванию)
// 4.1. Создайте компонент "Товар", который вы создавали в интернет - магазине BRAND
// 4.2. Создайте список товаров, используя компонент "Товар". Данные о товарах могут быть представлены в виде массива объектов.
// 4.3. Добавьте две кнопки сортировки(по убыванию, по возрастанию). При нажатии на кнопки, обновите список отображаемых товаров, отфильтрованных по цене. 

new Vue({
    el: '#task4',
    data: {}
});